.doom.d/config.org
#+title: My Doom Emacs Config
#+author: wzj
#+property: header-args :tangle config.el

* 个人信息
#+begin_src emacs-lisp
(setq user-full-name "wzj"
      user-mail-address "wzj19952545705@126.com")
#+end_src
* 字体
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "FiraCode Nerd Font" :size 20)
      doom-variable-pitch-font (font-spec :family "WenQuanYi Zen Hei" :size 18)
      doom-serif-font (font-spec :family "DejavuSans Mono" :size 19)
      doom-unicode-font (font-spec :family "FontAwesome" :size 19))
#+end_src
* 主题
#+begin_src emacs-lisp
(setq doom-theme 'doom-one)
#+end_src
* 相对+绝对行号
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative
      global-display-line-numbers-mode t)
#+end_src
* Org mode 个人化
** org agenda文件
#+begin_src emacs-lisp
(setq org-agenda-files '("~/nc/Org/agenda.org"))
#+end_src
** 实时载入 .org 调用代码到同名 .el 文件
#+begin_src emacs-lisp
(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config (setq org-auto-tangle-default t))
#+end_src
** Xelatex 编译链
#+begin_src emacs-lisp
(setq org-latex-pdf-process '("xelatex -interaction nonstopmode %f"
                              "xelatex -interaction nonstopmode %f"))
#+end_src
** 采用 org-modern 样式
*** 安装 org-modern
#+begin_src emacs-lisp
(use-package! org-modern)
(global-org-modern-mode 1)
#+end_src
*** Github官方建议的一些搭配设置
#+begin_src emacs-lisp
(modify-all-frames-parameters
 '((right-divider-width . 40)
   (internal-border-width . 40)))
(dolist (face '(window-divider
                window-divider-first-pixel
               window-divider-last-pixel))
 (face-spec-reset-face face)
 (set-face-foreground face (face-attribute 'default :background)))
(set-face-background 'fringe (face-attribute 'default :background))

(setq
; Edit settings
 org-auto-align-tags nil
 org-tags-column 0
 org-fold-catch-invisible-edits 'show-and-error
 org-special-ctrl-a/e t
 org-insert-heading-respect-content t
; Org styling, hide markup etc.
 org-hide-emphasis-markers t
 org-pretty-entities t
org-ellipsis " ▼ "
; Agenda styling
org-agenda-tags-column 0
org-agenda-block-separator ?─
org-agenda-time-grid
'((daily today require-timed)
  (800 1000 1200 1400 1600 1800 2000)
  " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
org-agenda-current-time-string
"⭠ now ─────────────────────────────────────────────────")
#+end_src
* 终端 Vterm
** 我用 fish
#+begin_src emacs-lisp
(setq shell-file-name "/usr/bin/fish"
      vterm-max-scrollback 5000)
#+end_src
